nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxn236/driver_examples/tdet/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made
 *to this file will be overwritten if the respective MCUXpresso Config Tools is
 *used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */
#define PORT5_PCR_MUX_mux11                                                    \
  0x03u /*!<@brief Pin Multiplex Control: Alternative 3 (chip-specific) */

/*! @name PORT1_8 (coord A1), P1_8/J9[12]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT                                      \
  PORT1 /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 8U /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN_MASK                                  \
  (1U << 8U) /*!<@brief PORT pin mask */
             /* @} */

/*! @name PORT1_9 (coord B1), P1_9/J9[11]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT                                      \
  PORT1 /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 9U /*!<@brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN_MASK                                  \
  (1U << 9U) /*!<@brief PORT pin mask */
             /* @} */

/*! @name PORT5_2 (coord M10), P5_2/J6[2]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TAMPER_0_PORT                                           \
  PORT5 /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TAMPER_0_PIN 2U /*!<@brief PORT pin number */
#define BOARD_INITPINS_TAMPER_0_PIN_MASK (1U << 2U) /*!<@brief PORT pin mask   \
                                                     */
                                                    /* @} */

/*! @name PORT5_3 (coord N11), P5_3/J6[1]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_TAMPER_1_PORT                                           \
  PORT5 /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_TAMPER_1_PIN 3U /*!<@brief PORT pin number */
#define BOARD_INITPINS_TAMPER_1_PIN_MASK (1U << 3U) /*!<@brief PORT pin mask   \
                                                     */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
